Get custom data real value for the specified custom data.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2017 Subscription Update
 Syntax
  C#
public double GetPartCustomDataReal(
	int customId
)
  Visual Basic
Public Function GetPartCustomDataReal ( _
	customId As Integer _
) As Double
  Visual C++
public:
double GetPartCustomDataReal(
	int customId
)
 Parameters
  customId
 Type:  System Int32
 The identifier of the custom data field to get.
 Return Value
 Returns the real number of the custom data. If the data is not a number it will return 0.0.
 See Also
  FabricationPart Class
  Autodesk.Revit.DB Namespace